# coding=utf-8
# 数据类型
# comments ues'#' 注释，解释代码
# none 空值
# None
# numeric
# int 整数
# float 浮点数

# 计算符号
# +
# -
# *
# / 浮点数除法
# // 整数除法
# % 求余
# ** 幂 类似 ^

# str
# 引号使用
print('单引号内的str')
print("'双引号扩住的字符串，打印出单引号'")
print("双引号扩住的字符串's，打印字符串中间的单引号,实现\n换行符")
print('''三个单引号扩住的字符串's，打印出字符串中的单引号，实现\n换行符''')
# r 原生字符串 r开头，原生字符串中的转义字原样输出
print(r"r开头字符串，原样打出's，and \n换行符")
# 两个\\，表现\
print('两个\\，print出一个')
# str()数字转换成字符串函数
print(str(16))
print("---------------------------------------------------------------")

# 变量variable
a = 2
b = 3
c = a + b
print(c)
print("---------------------------------------------------------------")
# type()
a = 4
b = '8'
c = '3.1415'
print(type(a))
print(type(b))
print(type(c))
c = float(c)
print(type(c))
print("---------------------------------------------------------------")
# 字节bytes
print(b'hello')
s = b'hellos'
s.decode()
print(s)
print("---------------------------------------------------------------")
# list
# 列表是可变的序列
# 可以包含零或多个元素，元素可以是 Python 中任何类型的对象
# 用逗号来分隔一系列元素，并把它们包裹在一对中括号中即可创建列表
print([1, 2, 3, 3])
foo = [1, 2, 3, 4, 5, 6]
print(foo)
print(foo[2])
# 字符串也是list
bar = '字符串也是list'
print(bar)
print(bar[3])
print("---------------------------------------------------------------")
# 元组tuple
# 不可变序列
baz = (1, 'a', 'ab', (3,  4))
print(baz[2])
print(baz[3][1])